# Pandas Data Manipulation

Some methods: `.isin()`, `sort_values()`, `.reset_index()`, `pd.merge()`, `pd.concat()`, `.set_index()`, `.get_dummies()` 

---

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('./datasets/football_deaths.csv') 
# https://www.kaggle.com/shivamb/football-deaths

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 229 entries, 0 to 228
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   row_id                229 non-null    int64
 1   incident_date         229 non-null    object
 2   player_name           229 non-null    object
 3   player_country        229 non-null    object
 4   team_country          227 non-null    object
 5   player_age            214 non-null    float64
 6   player_team_name      229 non-null    object
 7   incident_description  229 non-null    object
 8   heart_related         229 non-null    int64
 9   cardiac_related       229 non-null    int64
 10  collapsed             229 non-null    int64
 11  lightning             229 non-null    int64
 12  collision             229 non-null    int64
dtypes: float64(1), int64(6), object(6)
memory usage: 23.4+ KB

In [5]:
df.player_country.unique()

array(['England', 'Scotland', 'Wales', 'Kingdom of Yugoslavia', 'France',
       'Belgium', 'Chile', 'Iceland', 'Czechoslovakia',
       'Republic of Ireland', 'Peru', 'Norway', 'Netherlands',
       'West Germany', 'Brazil', 'United States', 'Romania',
       'Socialist Federal Republic of Yugoslavia', 'Spain', 'Portugal',
       'Italy', 'Algeria', 'Turkey', 'Netherlands Antilles', 'Nigeria',
       'Hungary', 'Zaire', 'Northern Ireland', 'Tunisia', 'Israel',
       'Germany', 'Indonesia', 'Poland', 'Federal Republic of Yugoslavia',
       'Czech Republic', 'Ukraine', 'Colombia', 'North Macedonia',
       'Trinidad and Tobago', 'Cameroon', 'Malaysia', 'Guatemala',
       'Denmark', 'Egypt', 'Bosnia and Herzegovina', 'Zambia', 'Gabon',
       'Croatia', 'Russia', 'Paraguay', 'Angola', 'United Arab Emirates',
       'Ghana', 'Liberia', 'Chad', 'Japan', 'India', 'Mauritania',
       'Cayman Islands', 'Sweden', 'Morocco', 'Kosovo', 'Kuwait', 'Mali',
       'Austria', 'Argentina', 'Togo', 'Nepal', 'Greece', 'Australia',
       'Burkina Faso', 'Jamaica', 'Tanzania', 'Botswana', 'Ethiopia',
       'Ivory Coast', 'Georgia (country)', 'South Africa', 'Burundi',
       'Uruguay', 'Iraq', 'Venezuela'], dtype=object)

In [10]:
europa = ['Spain', 'Portugal', 'Romania', 'Netherlands', 'Greece']

europa

['Spain', 'Portugal', 'Romania', 'Netherlands', 'Greece']

In [8]:
df[(df.player_country=='Spain') |
   (df.player_country=='Portugal') | 
   (df.player_country=='Romania')]

,row_id,incident_date,player_name,player_country,team_country,player_age,player_team_name,incident_description,heart_related,cardiac_related,collapsed,lightning,collision
35,36,1963-07-14,Constantin Tabarcea,Romania,Romania,26.0,Petrolul Ploieşti,Collapsed during a match. Death attributed to ...,0,0,1,0,0
38,39,1973-01-07,Pedro Berruezo,Spain,Spain,27.0,Sevilla F.C.,Heart attack during a Segunda División match a...,1,0,1,0,0
39,40,1973-12-16,Pavão,Portugal,Portugal,26.0,F.C. Porto,Heart attack during a league game.,1,0,0,0,0
48,49,1987-01-15,José Antonio Gallardo,Spain,Spain,25.0,CD Málaga,Collided with an opponent on December away to...,0,0,0,0,1
49,50,1987-08-23,Paulo Navalho,Portugal,Portugal,20.0,Atlético Clube de Portugal,Acute myocardial infarction during a friendly ...,0,0,0,0,0
54,55,1993-02-02,Michael Klein,Romania,Germany,33.0,Bayer Uerdingen,Heart attack during a training session.,1,0,0,0,0
63,64,1999-01-01,Ferenc Biro,Romania,Romania,15.0,Nirajul Miercurea-Nirajului,Died after a crossbar fell on his head during ...,0,0,0,0,0
64,65,1999-07-24,Ștefan Vrăbioru,Romania,Romania,23.0,Astra Ploieşti,Undetected heart defect that led to his collapse.,1,0,1,0,0
65,66,2000-01-01,Daniel Orbeanu,Romania,Romania,18.0,Caraimanul Buşteni,"Died after an infection from a simple sprain, ...",0,0,0,0,0
71,72,2000-10-05,Cătălin Hîldan,Romania,Romania,24.0,Dinamo București,Died while playing for Dinamo; In the th minut...,1,0,0,0,0
75,76,2002-02-20,Cristian Neamțu,Romania,Romania,21.0,Universitatea Craiova,Accidentally struck in the mandible by a teamm...,0,0,0,0,0
88,89,2005-05-27,Alin Paicu,Romania,Romania,32.0,Minerul Mătăsari,Collapsed after heading a ball. Died of a hear...,1,0,1,0,0
89,90,2005-06-25,Hugo Cunha,Portugal,Portugal,28.0,U.D. Leiria,Died suddenly from a cardiac arrest during a f...,0,1,0,0,0
98,99,2007-08-28,Antonio Puerta,Spain,Spain,22.0,Sevilla FC,Collapsed during a match against Getafe C.F.. ...,0,1,1,0,0
108,109,2009-08-08,Daniel Jarque,Spain,Spain,26.0,RCD Espanyol,Cardiac arrest following a training session.,0,1,0,0,0
109,110,2009-09-02,Alexandru Iatan,Romania,Romania,19.0,Dunărea Giurgiu,The Romanian goalkeeper was hit in the abdomin...,0,1,1,0,0
147,148,2013-11-17,Alex Marques[123],Portugal,Portugal,20.0,G.D. Tourizense,Cardiac arrest after seven minutes of the matc...,0,1,0,0,0
169,170,2016-03-13,Hugo Suárez,Spain,Spain,28.0,Llaranes,After approaching the bench during a Primera R...,0,0,1,0,0
193,194,2018-02-03,Nacho Barbera,Spain,Spain,15.0,UD Alzira,Collapsed on the field during a youth team mat...,0,0,1,0,0
203,204,2019-01-27,Francisco Cavada,Spain,Spain,32.0,Marina de Cudeyo,Collapsed in the nd minute of a Primera Region...,0,0,1,0,0

In [11]:
df[df.player_country.isin(europa)]

,row_id,incident_date,player_name,player_country,team_country,player_age,player_team_name,incident_description,heart_related,cardiac_related,collapsed,lightning,collision
30,31,1941-05-15,Law Adam,Netherlands,Netherlands,32.0,Thor,After retirement at the age of due to heart p...,1,0,0,0,0
35,36,1963-07-14,Constantin Tabarcea,Romania,Romania,26.0,Petrolul Ploieşti,Collapsed during a match. Death attributed to ...,0,0,1,0,0
38,39,1973-01-07,Pedro Berruezo,Spain,Spain,27.0,Sevilla F.C.,Heart attack during a Segunda División match a...,1,0,1,0,0
39,40,1973-12-16,Pavão,Portugal,Portugal,26.0,F.C. Porto,Heart attack during a league game.,1,0,0,0,0
47,48,1984-09-23,Erik Jongbloed,Netherlands,Netherlands,21.0,DWS,Struck by lightning during an exhibition game....,0,0,0,1,0
48,49,1987-01-15,José Antonio Gallardo,Spain,Spain,25.0,CD Málaga,Collided with an opponent on December away to...,0,0,0,0,1
49,50,1987-08-23,Paulo Navalho,Portugal,Portugal,20.0,Atlético Clube de Portugal,Acute myocardial infarction during a friendly ...,0,0,0,0,0
54,55,1993-02-02,Michael Klein,Romania,Germany,33.0,Bayer Uerdingen,Heart attack during a training session.,1,0,0,0,0
63,64,1999-01-01,Ferenc Biro,Romania,Romania,15.0,Nirajul Miercurea-Nirajului,Died after a crossbar fell on his head during ...,0,0,0,0,0
64,65,1999-07-24,Ștefan Vrăbioru,Romania,Romania,23.0,Astra Ploieşti,Undetected heart defect that led to his collapse.,1,0,1,0,0
65,66,2000-01-01,Daniel Orbeanu,Romania,Romania,18.0,Caraimanul Buşteni,"Died after an infection from a simple sprain, ...",0,0,0,0,0
71,72,2000-10-05,Cătălin Hîldan,Romania,Romania,24.0,Dinamo București,Died while playing for Dinamo; In the th minut...,1,0,0,0,0
75,76,2002-02-20,Cristian Neamțu,Romania,Romania,21.0,Universitatea Craiova,Accidentally struck in the mandible by a teamm...,0,0,0,0,0
88,89,2005-05-27,Alin Paicu,Romania,Romania,32.0,Minerul Mătăsari,Collapsed after heading a ball. Died of a hear...,1,0,1,0,0
89,90,2005-06-25,Hugo Cunha,Portugal,Portugal,28.0,U.D. Leiria,Died suddenly from a cardiac arrest during a f...,0,1,0,0,0
98,99,2007-08-28,Antonio Puerta,Spain,Spain,22.0,Sevilla FC,Collapsed during a match against Getafe C.F.. ...,0,1,1,0,0
108,109,2009-08-08,Daniel Jarque,Spain,Spain,26.0,RCD Espanyol,Cardiac arrest following a training session.,0,1,0,0,0
109,110,2009-09-02,Alexandru Iatan,Romania,Romania,19.0,Dunărea Giurgiu,The Romanian goalkeeper was hit in the abdomin...,0,1,1,0,0
147,148,2013-11-17,Alex Marques[123],Portugal,Portugal,20.0,G.D. Tourizense,Cardiac arrest after seven minutes of the matc...,0,1,0,0,0
167,168,2015-09-02,Stelios Markousis,Greece,Greece,18.0,Veria,Suffered a heart attack during a training sess...,1,0,0,0,0
169,170,2016-03-13,Hugo Suárez,Spain,Spain,28.0,Llaranes,After approaching the bench during a Primera R...,0,0,1,0,0
188,189,2017-09-17,Luc Jacobs,Netherlands,Netherlands,26.0,SC Helmondia [nl],Collapsed early in the second half of the matc...,1,0,1,0,0
193,194,2018-02-03,Nacho Barbera,Spain,Spain,15.0,UD Alzira,Collapsed on the field during a youth team mat...,0,0,1,0,0
198,199,2018-09-01,Tijmen Steenbergen,Netherlands,Netherlands,13.0,VV Marinus van Rooijen 's-Heerenberg,Dutch goalkeeper who died in a C Youth league ...,0,0,0,0,1
203,204,2019-01-27,Francisco Cavada,Spain,Spain,32.0,Marina de Cudeyo,Collapsed in the nd minute of a Primera Region...,0,0,1,0,0

---

### pandas.merge()  & pandas.concat()
df.join() & df.append()

https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

In [12]:
df_m1 = pd.DataFrame({'feature_key':['A','B','C'],
                      'name':['Name 1','Name 2','Name 3']})
df_m1

  feature_key    name
0           A  Name 1
1           B  Name 2
2           C  Name 3

In [15]:
import random as r
feature_options = ['A','B','C']
value_random = [r.randint(1,5) for i in range(10)]
feature_random = [feature_options[r.randint(0,2)] for i in range(10)]

In [16]:
df_m2 = pd.DataFrame({'feature_key':feature_random,
                      'value':value_random})
df_m2

  feature_key  value
0           B      1
1           B      1
2           C      2
3           C      3
4           B      5
5           C      5
6           B      1
7           C      4
8           B      3
9           B      2

In [18]:
df_m1.merge(df_m2)

  feature_key    name  value
0           B  Name 2      1
1           B  Name 2      1
2           B  Name 2      5
3           B  Name 2      1
4           B  Name 2      3
5           B  Name 2      2
6           C  Name 3      2
7           C  Name 3      3
8           C  Name 3      5
9           C  Name 3      4

In [19]:
df_m2.merge(df_m1)

  feature_key  value    name
0           B      1  Name 2
1           B      1  Name 2
2           B      5  Name 2
3           B      1  Name 2
4           B      3  Name 2
5           B      2  Name 2
6           C      2  Name 3
7           C      3  Name 3
8           C      5  Name 3
9           C      4  Name 3

In [21]:
#help(df_m1.merge)

In [22]:
df_m2.merge(df_m1, how='left')

  feature_key  value    name
0           B      1  Name 2
1           B      1  Name 2
2           C      2  Name 3
3           C      3  Name 3
4           B      5  Name 2
5           C      5  Name 3
6           B      1  Name 2
7           C      4  Name 3
8           B      3  Name 2
9           B      2  Name 2

In [23]:
df_m1.merge(df_m2, how='left')

   feature_key    name  value
0            A  Name 1    NaN
1            B  Name 2    1.0
2            B  Name 2    1.0
3            B  Name 2    5.0
4            B  Name 2    1.0
5            B  Name 2    3.0
6            B  Name 2    2.0
7            C  Name 3    2.0
8            C  Name 3    3.0
9            C  Name 3    5.0
10           C  Name 3    4.0

In [24]:
df_m1

  feature_key    name
0           A  Name 1
1           B  Name 2
2           C  Name 3

In [25]:
df_m1.merge(df_m2, how='right')

  feature_key    name  value
0           B  Name 2      1
1           B  Name 2      1
2           C  Name 3      2
3           C  Name 3      3
4           B  Name 2      5
5           C  Name 3      5
6           B  Name 2      1
7           C  Name 3      4
8           B  Name 2      3
9           B  Name 2      2

In [26]:
df_m2.merge(df_m1, how='left')

  feature_key  value    name
0           B      1  Name 2
1           B      1  Name 2
2           C      2  Name 3
3           C      3  Name 3
4           B      5  Name 2
5           C      5  Name 3
6           B      1  Name 2
7           C      4  Name 3
8           B      3  Name 2
9           B      2  Name 2

In [27]:
df_m2.merge(df_m1, how='outer')  # esto es un outer join

   feature_key  value    name
0            B    1.0  Name 2
1            B    1.0  Name 2
2            B    5.0  Name 2
3            B    1.0  Name 2
4            B    3.0  Name 2
5            B    2.0  Name 2
6            C    2.0  Name 3
7            C    3.0  Name 3
8            C    5.0  Name 3
9            C    4.0  Name 3
10           A    NaN  Name 1

In [28]:
df_m2

  feature_key  value
0           B      1
1           B      1
2           C      2
3           C      3
4           B      5
5           C      5
6           B      1
7           C      4
8           B      3
9           B      2

---

__JOIN Types__

![Image](./img/etl_pandas_manipulation_01.jpg)

![Image](./img/etl_pandas_manipulation_02.jpg)

In [29]:
pd.concat([df_m1, df_m2])

  feature_key    name  value
0           A  Name 1    NaN
1           B  Name 2    NaN
2           C  Name 3    NaN
0           B     NaN    1.0
1           B     NaN    1.0
2           C     NaN    2.0
3           C     NaN    3.0
4           B     NaN    5.0
5           C     NaN    5.0
6           B     NaN    1.0
7           C     NaN    4.0
8           B     NaN    3.0
9           B     NaN    2.0

In [31]:
#help(pd.concat)

In [32]:
pd.concat([df_m1, df_m2], axis=0)  # uno encima del otro

  feature_key    name  value
0           A  Name 1    NaN
1           B  Name 2    NaN
2           C  Name 3    NaN
0           B     NaN    1.0
1           B     NaN    1.0
2           C     NaN    2.0
3           C     NaN    3.0
4           B     NaN    5.0
5           C     NaN    5.0
6           B     NaN    1.0
7           C     NaN    4.0
8           B     NaN    3.0
9           B     NaN    2.0

In [33]:
pd.concat([df_m1, df_m2], axis=1)  # uno al lado del otro

  feature_key    name feature_key  value
0           A  Name 1           B      1
1           B  Name 2           B      1
2           C  Name 3           C      2
3         NaN     NaN           C      3
4         NaN     NaN           B      5
5         NaN     NaN           C      5
6         NaN     NaN           B      1
7         NaN     NaN           C      4
8         NaN     NaN           B      3
9         NaN     NaN           B      2

---

### pandas.get_dummies()

(a.k.a. One-Hot-Encoding)

https://pandas.pydata.org/docs/reference/api/pandas.get_dummies.html

In [35]:
df.player_country.unique()

array(['England', 'Scotland', 'Wales', 'Kingdom of Yugoslavia', 'France',
       'Belgium', 'Chile', 'Iceland', 'Czechoslovakia',
       'Republic of Ireland', 'Peru', 'Norway', 'Netherlands',
       'West Germany', 'Brazil', 'United States', 'Romania',
       'Socialist Federal Republic of Yugoslavia', 'Spain', 'Portugal',
       'Italy', 'Algeria', 'Turkey', 'Netherlands Antilles', 'Nigeria',
       'Hungary', 'Zaire', 'Northern Ireland', 'Tunisia', 'Israel',
       'Germany', 'Indonesia', 'Poland', 'Federal Republic of Yugoslavia',
       'Czech Republic', 'Ukraine', 'Colombia', 'North Macedonia',
       'Trinidad and Tobago', 'Cameroon', 'Malaysia', 'Guatemala',
       'Denmark', 'Egypt', 'Bosnia and Herzegovina', 'Zambia', 'Gabon',
       'Croatia', 'Russia', 'Paraguay', 'Angola', 'United Arab Emirates',
       'Ghana', 'Liberia', 'Chad', 'Japan', 'India', 'Mauritania',
       'Cayman Islands', 'Sweden', 'Morocco', 'Kosovo', 'Kuwait', 'Mali',
       'Austria', 'Argentina', 'Togo', 'Nepal', 'Greece', 'Australia',
       'Burkina Faso', 'Jamaica', 'Tanzania', 'Botswana', 'Ethiopia',
       'Ivory Coast', 'Georgia (country)', 'South Africa', 'Burundi',
       'Uruguay', 'Iraq', 'Venezuela'], dtype=object)

In [36]:
pd.get_dummies(df.player_country)

,Algeria,Angola,Argentina,Australia,Austria,Belgium,Bosnia and Herzegovina,Botswana,Brazil,Burkina Faso,...,Turkey,Ukraine,United Arab Emirates,United States,Uruguay,Venezuela,Wales,West Germany,Zaire,Zambia
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
224,0,0,0,0,0,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
225,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,1,0,0,0,0
226,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
227,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
228,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [37]:
df.shape

(229, 13)

In [41]:
pd.get_dummies(df[['player_country', 'team_country']]).head()

,player_country_Algeria,player_country_Angola,player_country_Argentina,player_country_Australia,player_country_Austria,player_country_Belgium,player_country_Bosnia and Herzegovina,player_country_Botswana,player_country_Brazil,player_country_Burkina Faso,...,team_country_Trinidad and Tobago,team_country_Tunisia,team_country_Turkey,team_country_United Arab Emirates,team_country_United States,team_country_Uruguay,team_country_Venezuela,team_country_Vietnam,team_country_Wales,team_country_West Germany
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [39]:
df.columns

Index(['row_id', 'incident_date', 'player_name', 'player_country',
       'team_country', 'player_age', 'player_team_name',
       'incident_description', 'heart_related', 'cardiac_related', 'collapsed',
       'lightning', 'collision'],
      dtype='object')

In [42]:
one_hot = pd.get_dummies(df[['player_country', 'team_country']])

In [46]:
pd.concat([df, one_hot], axis=1).head()

,row_id,incident_date,player_name,player_country,team_country,player_age,player_team_name,incident_description,heart_related,cardiac_related,...,team_country_Trinidad and Tobago,team_country_Tunisia,team_country_Turkey,team_country_United Arab Emirates,team_country_United States,team_country_Uruguay,team_country_Venezuela,team_country_Vietnam,team_country_Wales,team_country_West Germany
0,1,1889-01-13,William Cropper,England,England,26.0,Staveley,Ruptured bowel in a match against Grimsby Town...,0,0,...,0,0,0,0,0,0,0,0,0,0
1,2,1892-01-11,James Dunlop,Scotland,Scotland,21.0,St Mirren,Tetanus from fall on piece of glass in a frien...,0,0,...,0,0,0,0,0,0,0,0,0,0
2,3,1893-11-12,John Henry Morris,England,England,26.0,Shrewsbury Town,Internal haemorrhage following a bad tackle in...,0,0,...,0,0,0,0,0,0,0,0,0,0
3,4,1893-11-23,Walter Bannister,England,England,24.0,Chesterfield Town,Rupture of the kidney from a tackle in game ag...,0,0,...,0,0,0,0,0,0,0,0,0,0
4,5,1896-03-28,Teddy Smith,England,England,27.0,Bedminster,Suffered severe concussion following a clash o...,0,0,...,0,0,0,0,0,0,0,0,0,0

---

In [48]:
#df_m1.join(df_m2) # sobre indices